Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: قل لا أقول لكم عندي خزائن الله ولا أعلم الغيب ولا أقول لكم إني ملك إن أتبع إلا ما يوحى إلي قل هل يستوي الأعمى والبصير أفلا تتفكرون
en: Say (O Muhammad صلى الله عليه وسلم): "I don't tell you that with me are the treasures of Allah, nor (that) I know the Unseen; nor I tell you that I am an angel. I but follow what is revealed to me." Say: "Are the blind and the one who sees equal? Will you not then take thought?"

source: وأنذر به الذين يخافون أن يحشروا إلى ربهم ليس لهم من دونه ولي ولا شفيع لعلهم يتقون
en: And warn therewith (the Qur'an) those who fear that they will be gathered before their Lord, when there will be neither a protector nor an intercessor for them besides Him, so that they may fear Allah and keep their duty to Him (by abstaining from committing sins and by doing all kinds of good deeds which He has ordained).

source: ولا تطرد الذين يدعون ربهم بالغداة والعشي يريدون وجهه ما عليك من حسابهم من شيء وما من حسابك عليهم من شيء فتطردهم فتكون من الظالمين
en: And turn not away those who invoke their Lord, morning and afternoon seeking His Face. You are accountable for them in nothing, and they are accountable for you in nothing, that you may turn them away, and thus become of the Zalimun (unjust).

source: وكذلك فتنا بعضهم ببعض ليقولوا أهؤلاء من الله عليهم من بيننا أليس الله بأعلم بالشاكرين
en: Thus We have tried some of them with others, that they might say: "Is it these (poor believers) whom Allah has favoured from amongst us?" Does not Allah know best those who are grateful?

source: وإذا جاءك الذين يؤمنون بآياتنا فقل سلام عليكم كتب ربكم على نفسه الرحمة أنه من عمل منكم سوءا بجهالة ثم تاب من بعده وأصلح فأنه غفور رحيم
en: When those who believe in Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) come to you, say: "Salamun 'Alaikum" (peace be on you); your Lord has written (prescribed) Mercy for Himself, so that if any of you does evil in ignorance, and thereafter repents and does righteous good deeds (by obeying Allah), then surely, He is Oft-Forgiving, Most Merciful.

source: وكذلك نفصل الآيات ولتستبين سبيل المجرمين
en: And thus do We explain the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) in detail, that the way of the Mujrimun (criminals, polytheists, sinners) may become manifest.

source: قل إني نهيت أن أعبد الذين تدعون من دون الله قل لا أتبع أهواءكم قد ضللت إذا وما أنا من المهتدين
en: Say (O Muhammad صلى الله عليه وسلم): "I have been forbidden to worship those whom you invoke (worship) besides Allah." Say: "I will not follow your vain desires. If I did, I would go astray, and I would not be one of the rightly guided."

source: قل إني على بينة من ربي وكذبتم به ما عندي ما تستعجلون به إن الحكم إلا لله يقص الحق وهو خير الفاصلين
en: Say (O Muhammad صلى الله عليه وسلم): "I am on clear proof from my Lord (Islamic Monotheism), but you deny it (the truth that has come to me from Allah). I have not gotten what you are asking for impatiently (the torment). The decision is only for Allah, He declares the truth, and He is the Best of judges."

source: قل لو أن عندي ما تستعجلون به لقضي الأمر بيني وبينكم والله أعلم بالظالمين
en: Say: "If I had that which you are asking for impatiently (the torment), the matter would have been settled at once between me and you, but Allah knows best the Zalimun (polytheists and wrong-doers)."

source: وعنده مفاتح الغيب لا يعلمها إلا هو ويعلم ما في البر والبحر وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين
en: And with Him are the keys of the Ghaib (all that is hidden), none knows them but He. And He knows whatever there is in the land and in the sea; not a leaf falls, but he knows it. There is not a grain in the darkness of the earth nor anything fresh or dry, but is written in a Clear Record.

source: وهو الذي يتوفاكم بالليل ويعلم ما جرحتم بالنهار ثم يبعثكم فيه ليقضى أجل مسمى ثم إليه مرجعكم ثم ينبئكم بما كنتم تعملون
en: It is He Who takes your souls by night (when you are asleep), and has knowledge of all that you have done by day, then He raises (wakes) you up again that a term appointed (your life period) be fulfilled, then (in the end) unto Him will be your return. Then He will inform you of that which you used to do.

source: وهو القاهر فوق عباده ويرسل عليكم حفظة حتى إذا جاء أحدكم الموت توفته رسلنا وهم لا يفرطون
en: He is the Irresistible, (Supreme) over His slaves, and He sends guardians (angels guarding and writing all of one's good and bad deeds) over you, until when death approaches one of you, Our Messengers (angel of death and his assistants) take his soul, and they never neglect their duty.

source: ثم ردوا إلى الله مولاهم الحق ألا له الحكم وهو أسرع الحاسبين
en: Then they are returned to Allah, their True Maula [True Master (God), the Just Lord (to reward them)]. Surely, for Him is the judgement and He is the Swiftest in taking account.

source: قل من ينجيكم من ظلمات البر والبحر تدعونه تضرعا وخفية لئن أنجانا من هذه لنكونن من الشاكرين
en: Say (O Muhammad صلى الله عليه وسلم): "Who rescues you from the darkness of the land and the sea (dangers like storms), (when) you call upon Him in humility and in secret (saying): If He (Allah) only saves us from this (danger), we shall truly be grateful."

source: قل الله ينجيكم منها ومن كل كرب ثم أنتم تشركون
en: Say (O Muhammad صلى الله عليه وسلم): "Allah rescues you from this and from all (other) distresses, and yet you worship others besides Allah."

source: قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم أو يلبسكم شيعا ويذيق بعضكم بأس بعض انظر كيف نصرف الآيات لعلهم يفقهون
en: Say: "He has power to send torment on you from above or from under your feet, or to cover you with confusion in party strife, and make you to taste the violence of one another." See how variously We explain the Ayat (proofs, evidence, lessons, signs, revelations, etc.), so that they may understand.

source: وكذب به قومك وهو الحق قل لست عليكم بوكيل
en: But your people (O Muhammad صلى الله عليه وسلم) have denied it (the Qur'an) though it is the truth. Say: "I am not a Wakil (guardian) over you."

source: لكل نبإ مستقر وسوف تعلمون
en: For every news there is a reality and you will come to know.

source: وإذا رأيت الذين يخوضون في آياتنا فأعرض عنهم حتى يخوضوا في حديث غيره وإما ينسينك الشيطان فلا تقعد بعد الذكرى مع القوم الظالمين
en: And when you (Muhammad صلى الله عليه وسلم) see those who engage in a false conversation about Our Verses (of the Qur'an) by mocking at them, stay away from them till they turn to another topic. And if Shaitan (Satan) causes you to forget, then after the remembrance sit not you in the company of those people who are the Zalimun (polytheists and wrong-doers).

source: وما على الذين يتقون من حسابهم من شيء ولكن ذكرى لعلهم يتقون
en: Those who fear Allah, keep their duty to Him and avoid evil are not responsible for them (the disbelievers) in any case, but (their duty) is to remind them, that they may fear Allah (and refrain from mocking at the Qur'an). [The provision of this Verse was abrogated by the Verse 4:140].

source: وذر الذين اتخذوا دينهم لعبا ولهوا وغرتهم الحياة الدنيا وذكر به أن تبسل نفس بما كسبت ليس لها من دون الله ولي ولا شفيع وإن تعدل كل عدل لا يؤخذ منها أولئك الذين أبسلوا بما كسبوا لهم شراب من حميم وعذاب أليم بما كانوا يكفرون
en: And leave alone those who take their religion as play and amusement, and whom the life of this world has deceived. But remind (them) with it (the Qur'an) lest a person be given up to destruction for that which he has earned, when he will find for himself no protector or intercessor besides Allah, and even if he offers every ransom, it will not be accepted from him. Such are they who are given up to destruction because of that which they have earned. For them will be a drink of boiling water and a painful torment because they used to disbelieve.

source: قل أندعو من دون الله ما لا ينفعنا ولا يضرنا ونرد على أعقابنا بعد إذ هدانا الله كالذي استهوته الشياطين في الأرض حيران له أصحاب يدعونه إلى الهدى ائتنا قل إن هدى الله هو الهدى وأمرنا لنسلم لرب العالمين
en: Say (O Muhammad صلى الله عليه وسلم): "Shall we invoke others besides Allah (false deities), that can do us neither good nor harm, and shall we turn back on our heels after Allah has guided us (to true Monotheism)? - like one whom the Shayatin (devils) have made to go astray in the land in confusion, his companions calling him to guidance (saying): 'Come to us.' " Say: "Verily, Allah's Guidance is the only guidance, and we have been commanded to submit (ourselves) to the Lord of the 'Alamin (mankind, jinn and all that exists);

source: وأن أقيموا الصلاة واتقوه وهو الذي إليه تحشرون
en: And to perform As-Salat (Iqamat-as-Salat), and to be obedient to Allah and fear Him, and it is He to Whom you shall be gathered.

source: وهو الذي خلق السماوات والأرض بالحق ويوم يقول كن فيكون قوله الحق وله الملك يوم ينفخ في الصور عالم الغيب والشهادة وهو الحكيم الخبير
en: It is He Who has created the heavens and the earth in truth, and on the Day (i.e. the Day of Resurrection) He will say: "Be!", - and it is! His Word is the Truth. His will be the dominion on the Day when the Trumpet will be blown. All-Knower of the unseen and the seen. He is the All-Wise, Well-Aware (of all things).

source: وإذ قال إبراهيم لأبيه آزر أتتخذ أصناما آلهة إني أراك وقومك في ضلال مبين
en: And (remember) when Ibrahim (Abraham) said to his father Azar: "Do you take idols as alihah (gods)? Verily, I see you and your people in manifest error. "

source: وكذلك نري إبراهيم ملكوت السماوات والأرض وليكون من الموقنين
en: Thus did we show Ibrahim (Abraham) the kingdom of the heavens and the earth that he be one of those who have Faith with certainty.

source: فلما جن عليه الليل رأى كوكبا قال هذا ربي فلما أفل قال لا أحب الآفلين
en: When the night covered him over with darkness he saw a star. He said: "This is my lord." But when it set, he said: "I like not those that set."

source: فلما رأى القمر بازغا قال هذا ربي فلما أفل قال لئن لم يهدني ربي لأكونن من القوم الضالين
en: When he saw the moon rising up, he said: "This is my lord." But when it set, he said: "Unless my Lord guides me, I shall surely be among the people who went astray."

source: فلما رأى الشمس بازغة قال هذا ربي هذا أكبر فلما أفلت قال يا قوم إني بريء مما تشركون
en: When he saw the sun rising up, he said: "This is my lord. This is greater." But when it set, he said: "O my people! I am indeed free from all that you join as partners (in worship with Allah).

source: إني وجهت وجهي للذي فطر السماوات والأرض حنيفا وما أنا من المشركين
en: Verily, I have turned my face towards Him Who has created the heavens and the earth Hanifa (Islamic Monotheism, i.e. worshipping none but Allah Alone), and I am not of Al-Mushrikun (See V.2:105)".

source: وحاجه قومه قال أتحاجوني في الله وقد هدان ولا أخاف ما تشركون به إلا أن يشاء ربي شيئا وسع ربي كل شيء علما أفلا تتذكرون
en: His people disputed with him. He said: "Do you dispute with me concerning Allah while He has guided me, and I fear not those whom you associate with Him (Allah) in worship. (Nothing can happen to me) except when my Lord (Allah) wills something. My Lord comprehends in His Knowledge all things. Will you not then remember?

source: وكيف أخاف ما أشركتم ولا تخافون أنكم أشركتم بالله ما لم ينزل به عليكم سلطانا فأي الفريقين أحق بالأمن إن كنتم تعلمون
en: "And how should I fear those whom you associate in worship with Allah (though they can neither benefit nor harm), while you fear not that you have joined in worship with Allah things for which He has not sent down to you any authority. (So) which of the two parties has more right to be in security? If you but know."

source: الذين آمنوا ولم يلبسوا إيمانهم بظلم أولئك لهم الأمن وهم مهتدون
en: It is those who believe (in the Oneness of Allah and worship none but Him Alone) and confuse not their belief with Zulm (wrong i.e. by worshipping others besides Allah), for them (only) there is security and they are the guided.

source: وتلك حجتنا آتيناها إبراهيم على قومه نرفع درجات من نشاء إن ربك حكيم عليم
en: And that was Our Proof which We gave Ibrahim (Abraham) against his people. We raise whom We will in degrees. Certainly your Lord is All-Wise, All-Knowing.

source: ووهبنا له إسحاق ويعقوب كلا هدينا ونوحا هدينا من قبل ومن ذريته داوود وسليمان وأيوب ويوسف وموسى وهارون وكذلك نجزي المحسنين
en: And We bestowed upon him Ishaq (Isaac) and Ya'qub (Jacob), each of them We guided, and before him, We guided Nuh (Noah), and among his progeny Dawud (David), Sulaiman (Solomon), Ayyub (Job), Yusuf (Joseph), Musa (Moses), and Harun (Aaron). Thus do We reward Al-Muhsinun (the good-doers - see the footnote of V.9: 120).

source: وزكريا ويحيى وعيسى وإلياس كل من الصالحين
en: And Zakariya (Zachariya), and Yahya (John) and 'Îsa (Jesus) and Iliyas (Elias), each one of them was of the righteous.

source: وإسماعيل واليسع ويونس ولوطا وكلا فضلنا على العالمين
en: And Isma'il (Ishmael) and Al-Yasa' (Elisha), and Yunus (Jonah) and Lut (Lot), and each one of them We preferred above the 'Alamin [mankind and jinn (of their times)].

source: ومن آبائهم وذرياتهم وإخوانهم واجتبيناهم وهديناهم إلى صراط مستقيم
en: And also some of their fathers and their progeny and their brethren, We chose them, and We guided them to the Straight Path.

source: ذلك هدى الله يهدي به من يشاء من عباده ولو أشركوا لحبط عنهم ما كانوا يعملون
en: This is the Guidance of Allah with which He guides whomsoever He wills of His slaves. But if they had joined in worship others with Allah, all that they used to do would have been of no benefit to them.

source: أولئك الذين آتيناهم الكتاب والحكم والنبوة فإن يكفر بها هؤلاء فقد وكلنا بها قوما ليسوا بها بكافرين
en: They are those whom We gave the Book, Al-Hukm (understanding of the religious laws), and Prophethood. But if these disbelieve therein (the Book, Al-Hukm and Prophethood), then, indeed We have entrusted it to a people (such as the Companions of Prophet Muhammad صلى الله عليه وسلم) who are not disbelievers therein.

source: أولئك الذين هدى الله فبهداهم اقتده قل لا أسألكم عليه أجرا إن هو إلا ذكرى للعالمين
en: They are those whom Allah had guided. So follow their guidance. Say: "No reward I ask of you for this (the Qur'an). It is only a reminder for the 'Alamin (mankind and jinn)."

source: وما قدروا الله حق قدره إذ قالوا ما أنزل الله على بشر من شيء قل من أنزل الكتاب الذي جاء به موسى نورا وهدى للناس تجعلونه قراطيس تبدونها وتخفون كثيرا وعلمتم ما لم تعلموا أنتم ولا آباؤكم قل الله ثم ذرهم في خوضهم يلعبون
en: They (the Jews, Quraish pagans, idolaters) did not estimate Allah with an estimation due to Him when they said: "Nothing did Allah send down to any human being (by revelation)." Say (O Muhammad صلى الله عليه وسلم): "Who then sent down the Book which Musa (Moses) brought, a light and a guidance to mankind which you (the Jews) have made into (separate) papersheets, disclosing (some of it) and concealing much. And you (believers in Allah and His Messenger Muhammad صلى الله عليه وسلم) were taught (through the Qur'an) that which neither you nor your fathers knew." Say: "Allah (sent it down)." Then leave them to play in their vain discussions. (Tafsir Al-Qurtubi).

source: وهذا كتاب أنزلناه مبارك مصدق الذي بين يديه ولتنذر أم القرى ومن حولها والذين يؤمنون بالآخرة يؤمنون به وهم على صلاتهم يحافظون
en: And this (the Qur'an) is a blessed Book which We have sent down, confirming (the revelations) which came before it, so that you may warn the Mother of Towns (i.e. Makkah) and all those around it. Those who believe in the Hereafter believe in it (the Qur'an), and they are constant in guarding their Salat (prayers).

source: ومن أظلم ممن افترى على الله كذبا أو قال أوحي إلي ولم يوح إليه شيء ومن قال سأنزل مثل ما أنزل الله ولو ترى إذ الظالمون في غمرات الموت والملائكة باسطو أيديهم أخرجوا أنفسكم اليوم تجزون عذاب الهون بما كنتم تقولون على الله غير الحق وكنتم عن آياته تستكبرون
en: And who can be more unjust than he who invents a lie against Allah, or says: "A revelation has come to me" whereas no revelation has come to him in anything ; and who says, "I will reveal the like of what Allah has revealed." And if you could but see when the Zalimun (polytheists and wrong-doers) are in the agonies of death, while the angels are stretching forth their hands (saying): "Deliver your souls! This day you shall be recompensed with the torment of degradation because of what you used to utter against Allah other than the truth. And you used to reject His Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) with disrespect! "

source: ولقد جئتمونا فرادى كما خلقناكم أول مرة وتركتم ما خولناكم وراء ظهوركم وما نرى معكم شفعاءكم الذين زعمتم أنهم فيكم شركاء لقد تقطع بينكم وضل عنكم ما كنتم تزعمون
en: And truly you have come unto Us alone (without wealth, companions or anything else) as We created you the first time. You have left behind you all that which We had bestowed on you. We see not with you your intercessors whom you claimed to be partners with Allah. Now all relations between you and them have been cut off, and all that you used to claim has vanished from you.

source: إن الله فالق الحب والنوى يخرج الحي من الميت ومخرج الميت من الحي ذلكم الله فأنى تؤفكون
en: Verily! It is Allah Who causes the seed-grain and the fruit-stone (like date-stone) to split and sprout. He brings forth the living from the dead, and it is He Who brings forth the dead from the living. Such is Allah, then how are you deluded away from the truth?

source: فالق الإصباح وجعل الليل سكنا والشمس والقمر حسبانا ذلك تقدير العزيز العليم
en: (He is the) Cleaver of the daybreak. He has appointed the night for resting, and the sun and the moon for reckoning. Such is the measuring of the All-Mighty, the All-Knowing.

source: وهو الذي جعل لكم النجوم لتهتدوا بها في ظلمات البر والبحر قد فصلنا الآيات لقوم يعلمون
en: It is He Who has set the stars for you, so that you may guide your course with their help through the darkness of the land and the sea. We have (indeed) explained in detail Our Ayat (proofs, evidence, verses, lessons, signs, Revelations, etc.) for people who know.

source: وهو الذي أنشأكم من نفس واحدة فمستقر ومستودع قد فصلنا الآيات لقوم يفقهون
en: It is He Who has created you from a single person (Adam), and has given you a place of residing (on the earth or in your mother's wombs) and a place of storage [in the earth (in your graves) or in your father's loins]. Indeed, We have explained in detail Our revelations (this Qur'an) for people who understand.

source: وهو الذي أنزل من السماء ماء فأخرجنا به نبات كل شيء فأخرجنا منه خضرا نخرج منه حبا متراكبا ومن النخل من طلعها قنوان دانية وجنات من أعناب والزيتون والرمان مشتبها وغير متشابه انظروا إلى ثمره إذا أثمر وينعه إن في ذلكم لآيات لقوم يؤمنون
en: It is He Who sends down water (rain) from the sky, and with it We bring forth vegetation of all kinds, and out of it We bring forth green stalks, from which We bring forth thick clustered grain. And out of the date-palm and its spathe come forth clusters of dates hanging low and near, and gardens of grapes, olives and pomegranates, each similar (in kind) yet different (in variety and taste). Look at their fruits when they begin to bear, and the ripeness thereof. Verily! In these things there are signs for people who believe.

source: وجعلوا لله شركاء الجن وخلقهم وخرقوا له بنين وبنات بغير علم سبحانه وتعالى عما يصفون
en: Yet, they join the jinn as partners in worship with Allah, though He has created them (the jinn); and they attribute falsely without knowledge sons and daughters to Him. Be He Glorified and Exalted above all that (evil) they attribute to Him.

source: بديع السماوات والأرض أنى يكون له ولد ولم تكن له صاحبة وخلق كل شيء وهو بكل شيء عليم
en: He is the Originator of the heavens and the earth. How can He have children when He has no wife? He created all things and He is the All-Knower of everything .

source: ذلكم الله ربكم لا إله إلا هو خالق كل شيء فاعبدوه وهو على كل شيء وكيل
en: Such is Allah, your Lord! La ilaha illa Huwa (none has the right to be worshipped but He), the Creator of all things. So worship Him (Alone), and He is the Wakil (Trustee, Disposer of affairs, Guardian) over all things.

source: لا تدركه الأبصار وهو يدرك الأبصار وهو اللطيف الخبير
en: No vision can grasp Him, but He grasps all vision. He is Al-Latif (the Most Subtle and Courteous), Well-Acquainted with all things.

source: قد جاءكم بصائر من ربكم فمن أبصر فلنفسه ومن عمي فعليها وما أنا عليكم بحفيظ
en: Verily, proofs have come to you from your Lord, so whosoever sees, will do so for (the good of) his ownself, and whosoever blinds himself, will do so to his own harm, and I (Muhammad صلى الله عليه وسلم) am not a watcher over you.

source: وكذلك نصرف الآيات وليقولوا درست ولنبينه لقوم يعلمون
en: Thus We explain variously the Verses so that they (the disbelievers) may say: "You have studied (the Books of the people of the Scripture and brought this Qur'an from that)" and that We may make the matter clear for the people who have knowledge.

source: اتبع ما أوحي إليك من ربك لا إله إلا هو وأعرض عن المشركين
en: Follow what has been revealed to you (O Muhammad صلى الله عليه وسلم) from your Lord, La ilaha illa Huwa (none has the right to be worshipped but He) and turn aside from Al-Mushrikun

source: ولو شاء الله ما أشركوا وما جعلناك عليهم حفيظا وما أنت عليهم بوكيل
en: Had Allah willed, they would not have taken others besides Him in worship. And We have not made you a watcher over them nor are you a Wakil (disposer of affairs, guardian, trustee) over them.

source: ولا تسبوا الذين يدعون من دون الله فيسبوا الله عدوا بغير علم كذلك زينا لكل أمة عملهم ثم إلى ربهم مرجعهم فينبئهم بما كانوا يعملون
en: And insult not those whom they (disbelievers) worship besides Allah, lest they insult Allah wrongfully without knowledge. Thus We have made fair-seeming to each people its own doings; then to their Lord is their return and He shall then inform them of all that they used to do.

source: وأقسموا بالله جهد أيمانهم لئن جاءتهم آية ليؤمنن بها قل إنما الآيات عند الله وما يشعركم أنها إذا جاءت لا يؤمنون
en: And they swear their strongest oaths by Allah, that if there came to them a sign, they would surely believe therein. Say: "Signs are but with Allah and what will make you (Muslims) perceive that (even) if it (the sign) came, they will not believe?"

source: ونقلب أفئدتهم وأبصارهم كما لم يؤمنوا به أول مرة ونذرهم في طغيانهم يعمهون
en: And We shall turn their hearts and their eyes away (from guidance), as they refused to believe therein for the first time, and We shall leave them in their trespass to wander blindly.

source: ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا ما كانوا ليؤمنوا إلا أن يشاء الله ولكن أكثرهم يجهلون
en: And even if We had sent down unto them angels, and the dead had spoken unto them, and We had gathered together all things before their very eyes, they would not have believed, unless Allah willed, but most of them behave ignorantly.

source: وكذلك جعلنا لكل نبي عدوا شياطين الإنس والجن يوحي بعضهم إلى بعض زخرف القول غرورا ولو شاء ربك ما فعلوه فذرهم وما يفترون
en: And so We have appointed for every Prophet enemies - Shayatin (devils) among mankind and jinn, inspiring one another with adorned speech as a delusion (or by way of deception). If your Lord had so willed, they would not have done it; so leave them alone with their fabrications. (Tafsir Qurtubi)

source: ولتصغى إليه أفئدة الذين لا يؤمنون بالآخرة وليرضوه وليقترفوا ما هم مقترفون
en: (And this is in order) that the hearts of those who disbelieve in the Hereafter may incline to such (deceit), and that they may remain pleased with it, and that they may commit what they are committing (all kinds of sins and evil deeds).
